{
  "about": {
    "name": "Renato N. Alves",
    "birth_date": "03-20-1988",
    "city": "São Paulo",
    "province": "São Paulo",
    "province_code": "SP",
    "profile_image": "https://avatars2.githubusercontent.com/u/68507?s=230&v=4",
    "social": {
      "linkedin": "https://www.linkedin.com/in/renatoalvesdev/",
      "github": "https://github.com/renatodex",
      "facebook": "https://www.facebook.com/renato.millhouse"
    }
  },
  "education": {
    "0": {
      "name": "FIAP",
      "role": "Sistemas de Informação",
      "note": null,
      "started_at": "01-01-2009",
      "finished_at": "01-01-2012"
    },
    "1": {
      "title": "FIAP",
      "role": "Sistemas de Informação",
      "note": "Cursei apenas o primeiro ano.",
      "started_at": "01-01-2006",
      "finished_at": "01-01-2007"
    }
  },
  "teaching": {
    "0": {
      "title": "Web components Dojo at basico.com",
      "role": "Temporary Teacher",
      "description": "Since it was a bit hard to pass deep knowledges about HTML and CSS styling, we developed a web-component systems which allow people on basico.com to create complex and beautiful landing pages with few or no knowledge with HTML.",
      "note": null,
      "tags": ["web-components", "html", "grid", "shopify"],
      "started_at": "01-08-2018",
      "finished_at": "01-08-2018"
    },
    "1": {
      "title": "HTML and Frontend Dojo at basico.com",
      "role": "Temporary Teacher",
      "description": "As we had many designers at the time, the Dojo was an attempt to pass HTML knowledge to people so they could improve the creation of Marketing e-mails and Landing pages used often on basico.com",
      "note": null,
      "tags": ["html", "javascript", "css", "good_pratices"],
      "started_at": "01-09-2016",
      "finished_at": "01-09-2016"
    },
    "2": {
      "title": "Internet Security and Deep Web Dojo at basico.com",
      "role": "Temporary Teacher",
      "description": "This was an internal Dojo runned on the old Office from basico.com, explaining web security concepts to people from other areas, so they can understand why things are done the way they are and be more prepared for the frequently customer support questions.",
      "note": null,
      "tags": ["security", "deep_web", "xsi", "injections", "white_hacking"],
      "started_at": "01-08-2013",
      "finished_at": "01-08-2013"
    },
  },
  "jobs": {
    "0": {
      "title": "basico.com",
      "role": "Chief Technology Officer",
      "description": "basico is a Brazilian Fashion Brand born on the Online Channel. As a modern company, we focus on bringing the product to our customers at the most intelligent and efficient way. The technology is on the craddle of the company, and my role extend to all company areas, from Frontend/Backend development itself, to Inventory Management, Marketing, integrations, Operation improvements and so on.",
      "note": null,
      "tags": ["ruby", "git", "node", "javascript", "heroku", "agile", "vue", "postgresql"],
      "started_at": "01-01-2013",
      "finished_at": null
    },
    "1": {
      "title": "Percival the Perv",
      "role": "C# Developer",
      "description": "Percival was a Unity3D game created by me and a few other friends as an attempt to enter in the Game Development Market. Altought it was a 2D game built on Unity, it had a lot of complexity and helped us to understand all the technicallities of a Game Development process, including Story Boards, Sprite Development, and heavy physics programming. We exposed our game in a underground Game Fair where people from several studios have the oportunity to expose your game and receive feedback from real players. It was a richfull experience for us!",
      "note": null,
      "tags": ["c#", "unity3D", "json_parsers", "sprites", "story_board", "animation", "hud"],
      "started_at": "01-02-2014",
      "finished_at": "01-09-2014"
    },
    "2": {
      "title": "Pagseguro/UOL",
      "role": "Frontend Developer",
      "description": "I have worked developing the Customers Forums used by Pagseguro in the current days. I was also located temporarily to Guararapes to help training an incubated Pagseguro team with the company Stack. I have also helped with hiring of several great aquisitions for the team at the time, and i only left the company to help fund basico.com",
      "note": null,
      "tags": ["php", "git", "zend_framework", "amazon_aws", "api_integrations"],
      "started_at": "01-08-2012",
      "finished_at": "01-01-2013"
    },
    "3": {
      "title": "Magic Market",
      "role": "Lead Developer & Founder",
      "description": "Built as a platform to compare Magic the Gathering card prices, Magic Market raised enourmous interest from Tradegame Stores all around the Country. We were even called to sediate the technology platform of the LatinAmerica Tournament of Magic, hosted on Brazil.",
      "note": null,
      "tags": ["php", "git", "cake_php", "doctrine", "amazon_aws", "mysql"],
      "started_at": "01-01-2012",
      "finished_at": "01-01-2013"
    },
    "4": {
      "title": "Buonny",
      "role": "Lead Developer",
      "description": "I have worked as a Lead Developer, mantaining the company Products and adding new functionalities, from products evolving Truck Tracking to internal company products, Buonny was my first contact with a real Agile process. I learned a lot from the team and have contact with each one of them to this days",
      "note": null,
      "tags": ["php", "git", "cake_php", "doctrine", "amazon_aws", "sql_server"],
      "started_at": "01-01-2012",
      "finished_at": "01-04-2012"
    },
    "5": {
      "title": "Rede Bandeirantes",
      "role": "Backend Developer",
      "description": "Great part of my job is related in develop web applications to run in WAP environment.
I have aplications there for clients like BandNews and TIM.
Some of them are just used for intranet management, but a lot of products like TIM Games and LeoMobile (used as Mobile TV promos at Band TV), commonly receives a highly volumn of user access, forcing our team to care about subjects like perfomance, scalability and others related to cache.
There are also a lot of products that i was evolved related to SMS delivery, like Lottery (ClubeDaMega) and a SMS Footbal Commentator product.",
      "note": null,
      "tags": ["php", "svn", "zend_framework", "push_sms", "responsive_layout", "sql_server"],
      "started_at": "01-10-2010",
      "finished_at": "01-12-2011"
    },
    "6": {
      "title": "Samsung/Neotass",
      "role": "Web Developer",
      "description": "In my role, my job was focused in the Samsung account obtained by the agency a long time ago. Basicly, there were a lot of projects aiming intranet systems and a maintenance of a partner sales portal, called Canal Azul. I also did a number of jobs to clients like Kingston, Intel and Alcateia, including Hotsites and a interactive Form generator used to create registration forms pré-event.",
      "tags": ["php", "zend_framework", "rails", "mysql", "frontend_development", "javascript"],
      "started_at": "01-11-2009",
      "finished_at": "01-11-2010"
    },
    "7": {
      "title": "JHMA Studios",
      "role": "Web Developer",
      "description": "I have worked with big projects for big clients like TVA, Telefonica, Kelloggs, Sazon, Luxaflex and so on. That job gave me a completely different perspective about what it was to work with internet, and it was my first contact with a heavily job flow from Web Agencies.",
      "tags": ["asp", "php", "simphony", "zend_framework", "flash", "action_script", "after_effects", "frontend_development", "3d_modelling"],
      "started_at": "01-02-2008",
      "finished_at": "01-10-2009"
    },
    "8": {
      "title": "Ragmaníacos/Ayphos",
      "role": "Lead Developer & Sys-Admin",
      "description": "I have worked as a Lead Developer, with roles extending from Server Management, Programming, Community Management, and others. \nWe had servers running from 3k to 10k users, so my job was to guarantee that everyone would have a seemless experience playing the Game.",
      "note": "Ragmaníacos was a Ragnarok Private server",
      "tags": ["c_lang", "cpp_lang", "c#_lang", "unix", "compilation", "hex_debugging", "frontend_development", "mysql"],
      "started_at": "01-01-2002",
      "finished_at": "01-01-2007"
    }
  }
}
